In [151]:
#import libraries
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [152]:
#read data set from csv
data_set = pd.read_csv('Data.csv')
data_set

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [153]:
#Divide dependent and independent variable
X = data_set.iloc[:,:-1]
Y = data_set.iloc[:,3]
X

   Country   Age   Salary
0   France  44.0  72000.0
1    Spain  27.0  48000.0
2  Germany  30.0  54000.0
3    Spain  38.0  61000.0
4  Germany  40.0      NaN
5   France  35.0  58000.0
6    Spain   NaN  52000.0
7   France  48.0  79000.0
8  Germany  50.0  83000.0
9   France  37.0  67000.0

In [154]:
Y

0     No
1    Yes
2     No
3     No
4    Yes
5    Yes
6     No
7    Yes
8     No
9    Yes
Name: Purchased, dtype: object

In [155]:
# sklearn simple imputer to impute missing values with mean
from sklearn.impute import SimpleImputer

In [156]:
imp_mean = SimpleImputer(missing_values=np.nan, strategy='mean')

In [157]:
imp_mean.fit(X.iloc[:,-2:])

SimpleImputer()

In [158]:
X.iloc[:,-2:] = imp_mean.transform(X.iloc[:,-2:])

In [159]:
X

   Country        Age        Salary
0   France  44.000000  72000.000000
1    Spain  27.000000  48000.000000
2  Germany  30.000000  54000.000000
3    Spain  38.000000  61000.000000
4  Germany  40.000000  63777.777778
5   France  35.000000  58000.000000
6    Spain  38.777778  52000.000000
7   France  48.000000  79000.000000
8  Germany  50.000000  83000.000000
9   France  37.000000  67000.000000

In [160]:
#Encoding categorical data
from sklearn.preprocessing import LabelEncoder,OneHotEncoder

In [99]:

labelencoder_X = LabelEncoder()
X.iloc[:,0] = labelencoder_X.fit_transform(X.iloc[:,0])

In [161]:
# here this would cause an issue that one country val is greater than other so it might affect the equation
X

   Country        Age        Salary
0   France  44.000000  72000.000000
1    Spain  27.000000  48000.000000
2  Germany  30.000000  54000.000000
3    Spain  38.000000  61000.000000
4  Germany  40.000000  63777.777778
5   France  35.000000  58000.000000
6    Spain  38.777778  52000.000000
7   France  48.000000  79000.000000
8  Germany  50.000000  83000.000000
9   France  37.000000  67000.000000

In [140]:
onehotencoder=OneHotEncoder(handle_unknown='ignore')

In [165]:
enc_df =pd.DataFrame(onehotencoder.fit_transform(X[['Country']]).toarray())

In [166]:
X = X.join(enc_df)

In [167]:
X

   Country        Age        Salary    0    1    2
0   France  44.000000  72000.000000  1.0  0.0  0.0
1    Spain  27.000000  48000.000000  0.0  0.0  1.0
2  Germany  30.000000  54000.000000  0.0  1.0  0.0
3    Spain  38.000000  61000.000000  0.0  0.0  1.0
4  Germany  40.000000  63777.777778  0.0  1.0  0.0
5   France  35.000000  58000.000000  1.0  0.0  0.0
6    Spain  38.777778  52000.000000  0.0  0.0  1.0
7   France  48.000000  79000.000000  1.0  0.0  0.0
8  Germany  50.000000  83000.000000  0.0  1.0  0.0
9   France  37.000000  67000.000000  1.0  0.0  0.0

In [169]:
#label encoder for dependent variable/Target variable
labelencoder_Y = LabelEncoder()
Y.iloc[::] = labelencoder_Y.fit_transform(Y.iloc[::])

C:\Users\karthek.chakravarthy\Anaconda3\lib\site-packages\pandas\core\indexing.py:670: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  iloc._setitem_with_indexer(indexer, value)

In [170]:
Y

0    0
1    1
2    0
3    0
4    1
5    1
6    0
7    1
8    0
9    1
Name: Purchased, dtype: int32

In [171]:
X

   Country        Age        Salary    0    1    2
0   France  44.000000  72000.000000  1.0  0.0  0.0
1    Spain  27.000000  48000.000000  0.0  0.0  1.0
2  Germany  30.000000  54000.000000  0.0  1.0  0.0
3    Spain  38.000000  61000.000000  0.0  0.0  1.0
4  Germany  40.000000  63777.777778  0.0  1.0  0.0
5   France  35.000000  58000.000000  1.0  0.0  0.0
6    Spain  38.777778  52000.000000  0.0  0.0  1.0
7   France  48.000000  79000.000000  1.0  0.0  0.0
8  Germany  50.000000  83000.000000  0.0  1.0  0.0
9   France  37.000000  67000.000000  1.0  0.0  0.0

In [172]:
Y

0    0
1    1
2    0
3    0
4    1
5    1
6    0
7    1
8    0
9    1
Name: Purchased, dtype: int32

In [174]:
#Splitting datset into Training set and Testing set
from sklearn import model_selection

In [175]:
X_train , X_test,Y_train ,Y_test = model_selection.train_test_split(X,Y,test_size=0.2,random_state=101)

In [197]:
X_train =X_train.drop(['Country'], axis = 1)

In [198]:
X_test=X_test.drop(['Country'] ,axis=1)

In [179]:
Y_train

0    0
4    1
9    1
3    0
5    1
7    1
6    0
1    1
Name: Purchased, dtype: int32

In [180]:
Y_test

8    0
2    0
Name: Purchased, dtype: int32

In [193]:
#feature scaling 
from sklearn.preprocessing import StandardScaler

In [196]:
sc_x = StandardScaler()

In [199]:
X_train = sc_x.fit_transform(X_train)
X_test=sc_x.transform(X_test)

In [205]:
X_train =pd.DataFrame(X_train)

In [204]:
X_test = pd.DataFrame(X_test)

In [206]:
X_train

          0         1    2         3         4
0  0.951826  0.986148  1.0 -0.377964 -0.774597
1  0.263068  0.123815 -1.0  2.645751 -0.774597
2 -0.253501  0.461756  1.0 -0.377964 -0.774597
3 -0.081312 -0.167514 -1.0 -0.377964  1.290994
4 -0.597881 -0.482149  1.0 -0.377964 -0.774597
5  1.640585  1.720297  1.0 -0.377964 -0.774597
6  0.052614 -1.111420 -1.0 -0.377964  1.290994
7 -1.975398 -1.530933 -1.0 -0.377964  1.290994

In [207]:
X_test

          0         1    2         3         4
0  1.984964  2.139811 -1.0  2.645751 -0.774597
1 -1.458829 -0.901663 -1.0  2.645751 -0.774597